[
    {"name":"Pumpkin", "plantImage": "https://media.healthyfood.com/wp-content/uploads/2017/03/What-to-do-with-pumpkin-500x500.jpg" , "careImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/growing-pumpkin-1621443017.jpg", 
    "description": "A pumpkin is a cultivar of winter squash that is round with smooth, slightly ribbed skin, and is most often deep yellow to orange in coloration. The thick shell contains the seeds and pulp.", 
    "location": "Plant the seeds in hills. For bush type pumpkins, you'll need 3 feet around each plant. For the vining type, allow as much as 8' to 10' between plants for the vining type. Vining pumpkins require a great deal of space to spread. A big pumpkin vine can grow 6inch in one day.",
    "fertilization": "Apply a weekly nitrogen-heavy fertilizer early in the growing season to produce a healthy plant.",
    "soil": "Apply a weekly nitrogen-heavy fertilizer early in the growing season to produce a healthy plant. "}
   ,

   {"name":"Eggplant", "plantImage": "https://media.healthyfood.com/wp-content/uploads/2016/10/In-season-December-Eggplant-peaches-Thinkstock-462838893.jpg" , "careImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Solanum_melongena_24_08_2012_%281%29.JPG/1200px-Solanum_melongena_24_08_2012_%281%29.JPG", 
    "description": "Eggplant, aubergine or brinjal is a plant species in the nightshade family Solanaceae. Solanum melongena is grown worldwide for its edible fruit. Most commonly purple, the spongy, absorbent fruit is used in several cuisines. Typically used as a vegetable in cooking, it is a berry by botanical definition.", 
    "location": "Make sure your transplants go in a spot in the garden where they will get full sun.",
    "fertilization": "Eggplant requires moderate amounts of fertilizer. Mix 1 inch or so of well-rotted manure or a general fertilizer such as 5-10-10 throughout the planting bed about a week before planting. ",
    "soil": "Well-drained, fertile, sandy loam soils with a pH between 5.5 and 7.2."}
    ,

    {"name":"Potatoes", "plantImage": "https://cdn.britannica.com/w:1100/89/170689-131-D20F8F0A/Potatoes.jpg" , "careImage": "https://gardenerspath.com/wp-content/uploads/2019/03/Dug-up-mature-potato-plant.jpg", 
    "description": "The potato is a root vegetable native to the Americas, a starchy tuber of the plant Solanum tuberosum, and the plant itself is a perennial in the nightshade family, Solanaceae.", 
    "location": "Potatoes grow best in cool, well-drained, loose soil that is about 45° to 55°F (7° to 13°C). Choose a location that gets full sun—at least 6 hours of sunlight each day. Grow potatoes in rows spaced about 3 feet apart.",
    "fertilization": "Using a mixture of cottonseed meal, bone meal and greensand increases the soil's acidity and provides nitrogen, potassium and phosphorous. A small amount of kelp meal combined in the mixture supplies trace minerals.",
    "soil": "Well-drained soil. "},
        
    {"name":"Sweet Potato", "plantImage": "https://c.ndtvimg.com/2018-10/rn4qsd9_sweet-potatoes-_625x300_10_October_18.jpg" , "careImage": "https://www.gardeningknowhow.com/wp-content/uploads/2009/04/sweet-potatoes.jpg", 
    "description": "The sweet potato or sweetpotato is a dicotyledonous plant that belongs to the bindweed or morning glory family, Convolvulaceae. Its large, starchy, sweet-tasting, tuberous roots are a root vegetable. The young shoots and leaves are sometimes eaten as greens. ", 
    "location": " Plant in full sun three to four weeks after the last frost when the soil has warmed.",
    "fertilization": "You can begin fertilizing sweet potatoes about 2 weeks after transplanting them into your garden. After that, they can be fertilized every 4-6 weeks during the growing season. Stop fertilizing about 3 weeks before they are harvested. Generally, 3 doses of fertilizer throughout the growing season are sufficient.",
    "soil": "Sandy loam soil"},

    {"name":"Water Spinach", "plantImage": "https://cf.shopee.com.my/file/27e8310e447ec50e6ae7722440c81e22" , "careImage": "https://worldcrops.org/sites/worldcrops.org/files/crops/main_picture_700.jpg", 
    "description": "Water spinach is grown especially in the Southeast Asian region as a vegetable. It is a semi-aquatic plant, a creeper that grows in or near the water on moist soils.", 
    "location": "Water spinach grows in a warm and humid subtropical and tropical climate, so it is essential to provide it full sun. However, Water spinach also grows in partial shade.",
    "fertilization": "If growing Water spinach on the ground you don't need to fertilize it often but in containers fertilize it with high in nitrogen liquid fertilizer every other week.",
    "soil": "Rich loamy soil mixed with compost"},

    {"name":"Yam", "plantImage": "https://i.pinimg.com/originals/c8/0e/c0/c80ec037336ffaef514030655ee42a2d.jpg" , "careImage": "https://www.ohanaconfinement.com/wp-content/uploads/2018/03/Yam_Plant-1612x1074.jpg", 
    "description": "Yam is the common name for some plant species in the genus Dioscorea that form edible tubers. Yams are perennial herbaceous vines cultivated for the consumption of their starchy tubers in many temperate and tropical regions, especially in Africa, South America and the Caribbean, Asia, and Oceania.", 
    "location": "Yams grow best in moist, well-drained soil. ",
    "fertilization": "A hectare of Yam will need about 128kg Nitrogen (282 Kg of Indorama Granular Urea), 17kg Phosphorous and 162kg Potassium from the soil.",
    "soil": "Deep, loose, textured loamy soil that is rich in organic matter."},

    {"name":"Pandan", "plantImage": "https://image.freepik.com/free-photo/pandan-leaves_35641-1142.jpg" , "careImage": "https://gardendrum.com/wp-content/uploads/2017/10/Pandan-1.jpg", 
    "description": "Pandanus amaryllifolius is a tropical plant in the Pandanus genus, which is commonly known as pandan. It has fragrant leaves which are used widely for flavouring in the cuisines of Southeast Asia and South Asia. ", 
    "location": "Outside the house since it's requires a generous amount of sunlight daily – 6 to 8 hours a day is optimum",
    "fertilization": "Feed it regularly with an organic liquid fertilizer",
    "soil": "Pot up your Pandan Grass in rich potting soil full of nutrients"},

    {"name":"Scallions", "plantImage": "https://media.healthyfood.com/wp-content/uploads/2017/03/In-season-May-Spring-onions.jpg" , "careImage": "https://www.gardeningknowhow.com/wp-content/uploads/2020/12/spring-onions.jpg", 
    "description": "Scallions are vegetables derived from various species in the genus Allium. Scallions have a milder taste than most onions. Their close relatives include garlic, shallot, leek, chive, and Chinese onions. ", 
    "location": "Choose a location in full sun where you did not plant onions the previous year.",
    "fertilization": "Any 1-2-2 ratio fertilizer works well, such as a 5-10-10 blend, which contains 5 percent nitrogen, 10 percent phosphorus and 10 percent potassium.",
    "soil": "Organic soil that drains well"},

    {"name":"Corn", "plantImage": "https://www.italiancentre.ca/uploads/gallery/CornontheCob.png" , "careImage": "https://edge.bonnieplants.com/www/tiny/uploads/20200810203951/BONNIE-PLANTS_corn-iStock-857670630-2400px.jpg", 
    "description": "Maize, also known as corn, is a cereal grain first domesticated by indigenous peoples in southern Mexico about 10,000 years ago. The leafy stalk of the plant produces pollen inflorescences and separate ovuliferous inflorescences called ears that yield kernels or seeds, which are fruits. ", 
    "location": "Corn does best with warm, sunny growing weather (75–86° F), well-distributed intermittent moderate rains, or irrigation (15 or more inches during the growing season), and 130 or more frost-free days. ",
    "fertilization": "Fertilizer containing nitrogen such as a 46-0-0 ratio fertilizer",
    "soil": "Loam soils"},

    {"name":"Sugar Cane", "plantImage": "https://www.gardeningknowhow.com/wp-content/uploads/2018/07/sugarcane-variety.jpg" , "careImage": "https://www.smart-fertilizer.com/wp-content/uploads/2020/02/sugarcane-2.jpg", 
    "description": "Sugarcane or sugar cane refers to several species and hybrids of tall perennial grass in the genus Saccharum, tribe Andropogoneae, that are used for sugar production. The plants are 2-6 m tall with stout, jointed, fibrous stalks that are rich in sucrose, which accumulates in the stalk internodes.", 
    "location": "They need full sun, so choose an area that isn't shaded.",
    "fertilization": "Fertilizer containing nitrogen",
    "soil": "Loam soils"},

    {"name":"Durian", "plantImage": "https://static.libertyprim.com/files/familles/durian-large.jpg?1569271756" , "careImage": "https://www.gardeningknowhow.com/wp-content/uploads/2016/03/durian-fruit.jpg", 
    "description": "The durian is the edible fruit of several tree species belonging to the genus Durio. There are 30 recognised Durio species, at least nine of which produce edible fruit, with over 300 named varieties in Thailand and 100 in Malaysia, as of 1987.", 
    "location": "Durian trees grow best in a rich, deep, well-drained sandy clay or clay loam (deep alluvial or loamy soil), high in organic matter, pH range of 6 - 7.",
    "fertilization": "Premium bio-chemical fertilizer",
    "soil": "Sandy loam and clay loam"},

    {"name":"Tomatoes", "plantImage": "https://cdn.shopify.com/s/files/1/0244/4961/3905/products/tomato@2x.jpg?v=1576807420" , "careImage": "https://www.almanac.com/sites/default/files/image_nodes/tomatoes_helios4eos_gettyimages-edit.jpeg", 
    "description": "The tomato is the edible berry of the plant Solanum lycopersicum, commonly known as a tomato plant. The species originated in western South America and Central America. The Nahuatl word tomatl gave rise to the Spanish word tomate, from which the English word tomato derived.", 
    "location": "Pick a sunny spot and don't plant your tomatoes too close together. Tomato plants thrive in full sun and are healthier when provided good air circulation. Plant your seedlings deep, very deep. ",
    "fertilization": "Choose a fertilizer that has a balanced ratio of the three major elements, such as 10-10-10, or where the middle number (phosphorus) is larger than the first number (nitrogen), such as 2-3-1. ",
    "soil": "Well-drained soil that is high in organic matter and has a relatively neutral soil pH of around 6.0 to 6.8."}

]